In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(76, 'Jayden', 'Duffy', 'F', 'free'),
 (9, 'Wyatt', 'Scott', 'M', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'paid'),
 (78, 'Chloe', 'Roth', 'F', 'free'),
 (69, 'Anabelle', 'Simpson', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 25, 1, 39, 14, 796000), 1, '25', 47, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 25, 1, 42, 11, 796000), 1, '25', 47, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 25, 2, 35, 47, 796000), 2, '25', 47, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 25, 2, 40, 22, 796000), 2, '25', 47, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 25, 5, 5, 48, 796000), 5, '25', 47, 11, 2018, '6')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).